ka2_2024/src/Documents/ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога/ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога</name>
  <registerRecords>InformationRegister.ПараметрыНачисленияЗемельногоНалога</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоИмущественнымНалогам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказаныСпособыОтражениеРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРегистрации</name>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСнятияСРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КадастровыйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КадастроваяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСобственность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляВПравеОбщейСобственностиЧислитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляВПравеОбщейСобственностиЗнаменатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЖилищноеСтроительство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииПравНаОбъектНедвижимости</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыНалога</name>
    <attributes>
      <name>ДатаПараметров</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКатегорииЗемель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалоговаяЛьготаПоНалоговойБазе</name>
      <type>
        <types>EnumRef.ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УменьшениеНалоговойБазыПоСтатье391</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УменьшениеНалоговойБазыНаСумму</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляНеОблагаемойНалогомПлощадиЧислитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляНеОблагаемойНалогомПлощадиЗнаменатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОблагаемаяНалогомСумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СниженнаяНалоговаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентУменьшенияСуммыНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУменьшенияСуммыНалога</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалоговыйОрган</name>
    <attributes>
      <name>ДатаПараметров</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПостановкаНаУчетВНалоговомОргане</name>
      <type>
        <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйОрган</name>
      <type>
        <types>CatalogRef.РегистрацииВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПоОКТМО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтражениеРасходов</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/InformationRegisters/ПараметрыНачисленияЗемельногоНалога/ПараметрыНачисленияЗемельногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыНачисленияЗемельногоНалога</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВключатьВНалоговуюБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаПроектирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииПравНаОбъектНедвижимости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляВПравеОбщейСобственностиЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляВПравеОбщейСобственностиЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляНеОблагаемойНалогомПлощадиЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляНеОблагаемойНалогомПлощадиЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖилищноеСтроительство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодКатегорииЗемель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготыОсвобождениеОтНалогообложенияПоСтатье395</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготыУменьшениеНалоговойБазыПоСтатье391</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговаяЛьготаПоНалоговойБазе</name>
    <type>
      <types>EnumRef.ВидНалоговойЛьготыПоНалоговойБазеПоЗемельномуНалогу</types>
    </type>
  </resources>
  <resources>
    <name>НалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалоговыйОрган</name>
    <comment>Код налогового органа (по месту регистрации имущества)</comment>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>НеОблагаемаяНалогомСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОбщаяСобственность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПостановкаНаУчетВНалоговомОргане</name>
    <type>
      <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентУменьшенияСуммыНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СниженнаяНалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУменьшенияСуммыНалога</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>УменьшениеНалоговойБазыНаСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УменьшениеНалоговойБазыПоСтатье391</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидЗаписиОРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Enums/ПостановкаНаУчетВНалоговомОргане/ПостановкаНаУчетВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПостановкаНаУчетВНалоговомОргане</name>
  <enumValues>
    <name>ПоМестуНахожденияОрганизации</name>
  </enumValues>
  <enumValues>
    <name>СДругимКодомПоОКАТО</name>
  </enumValues>
  <enumValues>
    <name>ВДругомНалоговомОргане</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ГруппыОС/ГруппыОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыОС</name>
  <enumValues>
    <name>Здания</name>
  </enumValues>
  <enumValues>
    <name>Сооружения</name>
  </enumValues>
  <enumValues>
    <name>МашиныИОборудование</name>
  </enumValues>
  <enumValues>
    <name>ОфисноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеСредства</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйИХозяйственныйИнвентарь</name>
  </enumValues>
  <enumValues>
    <name>РабочийСкот</name>
  </enumValues>
  <enumValues>
    <name>ПродуктивныйСкот</name>
  </enumValues>
  <enumValues>
    <name>МноголетниеНасаждения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыПриродопользования</name>
  </enumValues>
  <enumValues>
    <name>КапитальныеВложенияВАрендованноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ПрочееИмуществоТребующееГосударственнойРегистрации</name>
  </enumValues>
  <enumValues>
    <name>ДругиеВидыОсновныхСредств</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Documents/ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		ЗаполнитьНаОснованииОбъектаЭксплуатации(ДанныеЗаполнения);
	КонецЕсли;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПараметрыНачисленияЗемельногоНалога.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЗаполнитьРеквизитыПередЗаписью();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьНаличиеПараметровНаДату(Отказ);
	КонецЕсли;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ПроверитьРеквизиты(НепроверяемыеРеквизиты, Отказ);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(
		НСтр("ru = 'Ввод первоначальных сведений для расчета земельного налога'"));
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Ответственный = Пользователи.ТекущийПользователь();
	
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПередЗаписью()
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));
	
	ПараметрыРеквизитовОбъекта = ИмущественныеНалогиКлиентСервер.НастройкаРеквизитов_ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога(ЭтотОбъект);
	ОбщегоНазначенияУТКлиентСервер.ОчиститьНеиспользуемыеРеквизиты(
		ЭтотОбъект, ПараметрыРеквизитовОбъекта, "ПараметрыРегистрации,ПараметрыНалога,НалоговыйОрган");
	
	УказаныСпособыОтражениеРасходов = (ОтражениеРасходов.Количество() <> 0);
	
	Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл
		
		Если Не ДанныеСтроки.ОбщаяСобственность Тогда
			ДанныеСтроки.ДоляВПравеОбщейСобственностиЧислитель = 0;
			ДанныеСтроки.ДоляВПравеОбщейСобственностиЗнаменатель = 0;
		КонецЕсли;
		
		Если Не ДанныеСтроки.ЖилищноеСтроительство Тогда
			ДанныеСтроки.ДатаРегистрацииПравНаОбъектНедвижимости = '000101010000';
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из ПараметрыНалога Цикл
		
		Если УчетСНачалаГода Тогда
			ДанныеСтроки.ДатаПараметров = КонецМесяца(Дата) + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из НалоговыйОрган Цикл
		
		Если УчетСНачалаГода Тогда
			ДанныеСтроки.ДатаПараметров = КонецМесяца(Дата) + 1;
		КонецЕсли;
		
		Если ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО
			И ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане = Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
			
			ДанныеСтроки.КодПоОКТМО = "";
		КонецЕсли;
		
		Если ДанныеСтроки.ПостановкаНаУчетВНалоговомОргане <> Перечисления.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане Тогда
			ДанныеСтроки.НалоговыйОрган = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Основание)

	Если Основание.Свойство("Дата") Тогда
		Дата = Основание.Дата;
	КонецЕсли;
	
	Если Основание.Свойство("Организация")
		И ЗначениеЗаполнено(Основание.Организация) Тогда
		Организация = Основание.Организация;
	КонецЕсли;

	Если Основание.Свойство("ОсновноеСредство") Тогда
		ЗаполнитьНаОснованииОбъектаЭксплуатации(Основание.ОсновноеСредство);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииОбъектаЭксплуатации(ДанныеЗаполнения)
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "ЭтоГруппа,ГруппаОС");
	
	Если РеквизитыОснования.ЭтоГруппа Тогда
		
		ТекстСообщения = НСтр("ru = 'Оформление документа на основании группы ОС невозможен.
			|Выберите ОС. Для раскрытия группы используйте клавиши Ctrl и стрелку вниз.'");
			
		ВызватьИсключение(ТекстСообщения);
		
	ИначеЕсли РеквизитыОснования.ГруппаОС <> Перечисления.ГруппыОС.ЗемельныеУчастки Тогда
		
		ТекстСообщения = НСтр("ru = 'Оформление документа доступно только для земельных участков.'");
			
		ВызватьИсключение(ТекстСообщения);
			
	КонецЕсли;
	
	ОсновноеСредство = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ПроверитьРеквизиты(НепроверяемыеРеквизиты, Отказ)
	
	ПараметрыРеквизитовОбъекта = ИмущественныеНалогиКлиентСервер.НастройкаРеквизитов_ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога(
									ЭтотОбъект);
									
	ОбщегоНазначенияУТ.ОтключитьПроверкуЗаполненияРеквизитовОбъекта(ПараметрыРеквизитовОбъекта, НепроверяемыеРеквизиты);
	
	ПроверитьДатыПараметров(НепроверяемыеРеквизиты, Отказ);
	
	ПроверитьПараметрыРегистрации(НепроверяемыеРеквизиты, Отказ);
	ПроверитьПараметрыНалога(НепроверяемыеРеквизиты, Отказ);
	ПроверитьНалоговыйОрган(НепроверяемыеРеквизиты, Отказ);
	
КонецПроцедуры

Процедура ПроверитьДатыПараметров(НепроверяемыеРеквизиты, Отказ)
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));

	Если УчетСНачалаГода Тогда
		
		НепроверяемыеРеквизиты.Добавить("ПараметрыНалога.ДатаПараметров");
		НепроверяемыеРеквизиты.Добавить("НалоговыйОрган.ДатаПараметров");
		
		Возврат;
		
	КонецЕсли;
	
	МинимальнаяДата = '000101010000';
	НачалоГода = НачалоГода(Дата);
	
	Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл
		
		Если ДанныеСтроки.ДатаРегистрации > КонецДня(Дата)
			И ЗначениеЗаполнено(ДанныеСтроки.ДатаРегистрации) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата сведений о регистрации должна быть раньше начала учета %1'"),
				ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(КонецМесяца(Дата) + 1));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДатаРегистрации");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаСнятияСРегистрации < НачалоГода
			И ЗначениеЗаполнено(ДанныеСтроки.ДатаСнятияСРегистрации) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата снятия с регистрации должна быть не раньше начала года %1'"),
				Формат(НачалоГода, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДатаСнятияСРегистрации");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		ИначеЕсли ДанныеСтроки.ДатаСнятияСРегистрации > КонецДня(Дата)
			И ЗначениеЗаполнено(ДанныеСтроки.ДатаСнятияСРегистрации) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата снятия с регистрации должна быть раньше начала учета %1'"),
				ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(КонецМесяца(Дата) + 1));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДатаСнятияСРегистрации");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаСнятияСРегистрации < ДанныеСтроки.ДатаРегистрации 
			И ЗначениеЗаполнено(ДанныеСтроки.ДатаРегистрации)
			И ЗначениеЗаполнено(ДанныеСтроки.ДатаСнятияСРегистрации) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата снятия с регистрации должна быть не раньше даты регистрации или изменений %1'"),
				Формат(ДанныеСтроки.ДатаРегистрации, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДатаСнятияСРегистрации");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		МинимальнаяДата = ?(МинимальнаяДата <> '000101010000', 
							Мин(ДанныеСтроки.ДатаРегистрации, МинимальнаяДата), 
							ДанныеСтроки.ДатаРегистрации);
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из ПараметрыНалога Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаПараметров) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаПараметров < НачалоГода Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата параметров начисления налога должна быть не раньше начала года %1'"),
				Формат(НачалоГода, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыНалога", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		ИначеЕсли ДанныеСтроки.ДатаПараметров > КонецДня(Дата) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата параметров начисления налога должна быть не позже даты документа %1'"),
				Формат(Дата, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПараметрыНалога", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		МинимальнаяДата = ?(МинимальнаяДата <> '000101010000', 
							Мин(ДанныеСтроки.ДатаПараметров, МинимальнаяДата), 
							ДанныеСтроки.ДатаПараметров);
		
	КонецЦикла;
	
	Для Каждого ДанныеСтроки Из НалоговыйОрган Цикл

		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаПараметров) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСтроки.ДатаПараметров < НачалоГода Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата регистрации в налоговом органе должна быть не раньше начала года %1'"),
				Формат(НачалоГода, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"НалоговыйОрган", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		ИначеЕсли ДанныеСтроки.ДатаПараметров > КонецДня(Дата) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Дата регистрации в налоговом органе должна быть не позже даты документа %1'"),
				Формат(Дата, "ДЛФ=D;"));
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"НалоговыйОрган", ДанныеСтроки.НомерСтроки, "ДатаПараметров");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		МинимальнаяДата = ?(МинимальнаяДата <> '000101010000', 
							Мин(ДанныеСтроки.ДатаПараметров, МинимальнаяДата), 
							ДанныеСтроки.ДатаПараметров);

	КонецЦикла;
	
	Если МинимальнаяДата <> '000101010000' Тогда
		
		МинимальнаяДата = Макс(МинимальнаяДата, НачалоГода);
		
		Если ПараметрыРегистрации.Найти(МинимальнаяДата, "ДатаРегистрации") = Неопределено
			И ПараметрыРегистрации.Количество() <> 0 Тогда
			
			ЕстьПараметры = Ложь;
			Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл
				Если ДанныеСтроки.ДатаРегистрации < МинимальнаяДата
					И ЗначениеЗаполнено(ДанныеСтроки.ДатаРегистрации) Тогда
					ЕстьПараметры = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ЕстьПараметры Тогда
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'В списке ""Сведения о регистрации"" необходимо указать параметры на дату %1'"), 
					Формат(МинимальнаяДата, "ДЛФ=D;"));
					
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыРегистрации",, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыНалога.Найти(МинимальнаяДата, "ДатаПараметров") = Неопределено
			И ПараметрыНалога.Количество() <> 0 Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В списке ""Земельный налог"" необходимо указать параметры на дату %1'"), 
				Формат(МинимальнаяДата, "ДЛФ=D;"));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыНалога",, Отказ);
			
		КонецЕсли;
		
		Если НалоговыйОрган.Найти(МинимальнаяДата, "ДатаПараметров") = Неопределено
			И НалоговыйОрган.Количество() <> 0 Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В списке ""Налоговый орган"" необходимо указать параметры на дату %1'"), 
				Формат(МинимальнаяДата, "ДЛФ=D;"));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НалоговыйОрган",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПараметрыРегистрации(НепроверяемыеРеквизиты, Отказ)
	
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляВПравеОбщейСобственностиЧислитель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДоляВПравеОбщейСобственностиЗнаменатель");
	НепроверяемыеРеквизиты.Добавить("ПараметрыРегистрации.ДатаРегистрацииПравНаОбъектНедвижимости");
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%1"" в строке %2 списка ""Сведения о регистрации""'");
	
	Если УчетСНачалаГода И ПараметрыРегистрации.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='При учете с начала года вводится только одна строка сведений о регистрации'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыРегистрации",, Отказ);
		
	Иначе
		
		ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ПараметрыРегистрации", "ДатаРегистрации", Отказ);
	
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из ПараметрыРегистрации Цикл
		
		Если ДанныеСтроки.ОбщаяСобственность Тогда
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляВПравеОбщейСобственностиЧислитель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Числитель доли в праве общей собственности'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляВПравеОбщейСобственностиЧислитель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ДоляВПравеОбщейСобственностиЗнаменатель) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru='Знаменатель доли в праве общей собственности'"), ДанныеСтроки.НомерСтроки);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"ПараметрыРегистрации", ДанныеСтроки.НомерСтроки, "ДоляВПравеОбщейСобственностиЗнаменатель");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПараметрыНалога(НепроверяемыеРеквизиты, Отказ)
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));

	Если УчетСНачалаГода И ПараметрыНалога.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='При учете с начала года вводится только одна строка параметров налога'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ПараметрыНалога",, Отказ);
		
	Иначе
		
		ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ПараметрыНалога", "ДатаПараметров", Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНалоговыйОрган(НепроверяемыеРеквизиты, Отказ)
	
	УчетСНачалаГода = (КонецМесяца(Дата) = КонецГода(Дата));
	
	Если УчетСНачалаГода И НалоговыйОрган.Количество() > 1 Тогда
		
		ТекстСообщения = НСтр("ru='При учете с начала года вводится только одна строка параметров налогового органа'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НалоговыйОрган",, Отказ);
		
	Иначе
		
		ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "НалоговыйОрган", "ДатаПараметров", Отказ);
		
	КонецЕсли;
	
	ИмущественныеНалоги.ПроверитьНалоговыйОрган(ЭтотОбъект, НепроверяемыеРеквизиты, Отказ);
	
КонецПроцедуры

Процедура ПроверитьНаличиеПараметровНаДату(Отказ)

	СписокЗапросов = Новый СписокЗначений();
	
	Документы.ВводПервоначальныхСведенийДляРасчетаЗемельногоНалога.ТекстЗапросаТаблицаВтДатыПараметровПоследние(СписокЗапросов);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.ОсновноеСредство.Представление КАК ОсновноеСредствоПредставление
	|ИЗ
	|	втДатыПараметровПоследние КАК втДатыПараметровПоследние
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыНачисленияЗемельногоНалога КАК ДанныеРегистра
	|		ПО ДанныеРегистра.Период = НАЧАЛОПЕРИОДА(втДатыПараметровПоследние.Дата, ДЕНЬ)
	|			И ДанныеРегистра.Регистратор <> &Ссылка
	|			И ДанныеРегистра.Организация = &Организация
	|			И ДанныеРегистра.ОсновноеСредство = &ОсновноеСредство
	|			И ДанныеРегистра.Активность
	|";
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(КонецДня(Дата) + 1));
	
	ШаблонСообщения = НСтр("ru = 'Для земельного участка ""%1"" уже введены параметры на %2 документом %3.
						   |Не поддерживается ввод параметров на одну дату разными документами.'");
	
	Результаты = ОбщегоНазначенияУТ.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	Выборка = Результаты[Результаты.ВГраница()].Выбрать();

	Если Выборка.Следующий() Тогда
	
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОсновноеСредствоПредставление, Формат(Выборка.Период, "ДЛФ=D;"), Выборка.Регистратор);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ОсновноеСредство", , Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
